app/views/idea_images/edit.html.erb


      <%= select_tag :idea_id, options_from_collection_for_select(Idea.all, :id, :title, @idea_image.idea_id), class: 'form-control' %>
---
SELECT "ideas".* FROM "ideas"