app/views/idea_images/new.html.erb

SELECT "ideas".* FROM "ideas"
---

      <%= select_tag :idea_id, options_from_collection_for_select(Idea.all, :id, :title), class: 'form-control' %>