app/views/ideas/edit.html.erb

SELECT "artists".* FROM "artists"
---
    <div class="col-md-6">
    <%= select_tag :artist_id, options_from_collection_for_select(Artist.all, :id, :full_name, @idea.artist_id), class: 'form-control' %>

SELECT "idea_images".* FROM "idea_images" WHERE "idea_images"."idea_id" = ?  [["idea_id", 6]]
SELECT "ideas".* FROM "ideas"
---
  <tbody>
    <% @idea.idea_images.each do |idea_image| %>