app/views/ideas/index.html.erb

SELECT COUNT(*) FROM "bids" WHERE "bids"."idea_id" = ?  [["idea_id", 2]]
---
          <td>$<%= idea.price.round(0) %></td>
          <td><%= idea.bids.count %></td>