app/views/ideas/new.html.erb

SELECT "artists".* FROM "artists"
---
    <div class="col-md-6">
      <%= select_tag :artist_id, options_from_collection_for_select(Artist.all, :id, :first_name), class: 'form-control' %>