app/views/ideas/show.html.erb

    <% if @idea.artist_id != nil %>
      <%= @idea.artist.first_name %> <%= @idea.artist.last_name %>
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = 1 ORDER BY "artists"."id" ASC LIMIT 1

  <dt># of bids</dt>
  <dd> <%= @idea.bids.count %>
---
SELECT "bids".* FROM "bids" WHERE "bids"."idea_id" = ? AND (2) LIMIT 1  [["idea_id", 9]]
SELECT COUNT(*) FROM "bids" WHERE "bids"."idea_id" = ?  [["idea_id", 2]]

     <% a = @idea.id %>
   <% b = IdeaImage.where(:idea_id => a) %>
---
SELECT "idea_images".* FROM "idea_images" WHERE "idea_images"."idea_id" = 6

          <% a = bid.artist_id %>
           <% b = Idea.where(:artist_id => a) %>
---
SELECT "ideas".* FROM "ideas" WHERE "ideas"."artist_id" = 1