app/views/artists/show.html.erb

	   <% a = @artist.id %>
	   <% b = Idea.where(:artist_id => a) %>
---
SELECT "ideas".* FROM "ideas" WHERE "ideas"."artist_id" = 1

	   <% a = @artist.id %>
	   <% b = PortfolioImage.where(:artist_id => a) %>
---
SELECT "portfolio_images".* FROM "portfolio_images" WHERE "portfolio_images"."artist_id" = 1