app/views/bids/new.html.erb

    <div class="col-md-6">
      <%= select_tag :idea_id, options_from_collection_for_select(Idea.all, :id, :title), class: 'form-control' %>
---
SELECT "ideas".* FROM "ideas"

    <div class="col-md-6">
      <%= select_tag :artist_id, options_from_collection_for_select(Artist.all, :id, :first_name), class: 'form-control' %>
---
SELECT "artists".* FROM "artists"