app/controllers/artists_controller.rb

  def set_artist
    @artist = Artist.find(params[:id])
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = 6 ORDER BY "artists"."id" ASC LIMIT 1

  def update
    @artist.first_name = params[:first_name]
    @artist.last_name = params[:last_name]
    @artist.email = current_artist.email
    @artist.bio = params[:bio]

    if @artist.save
---
UPDATE "artists" SET "first_name" = ?, "last_name" = ?, "bio" = ? WHERE "artists"."id" = 1  [["first_name", "Tricia"], ["last_name", "Vail"], ["bio", "I love to paint!"]]

  def destroy

    @artist.destroy
---
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 4]]