app/controllers/bids_controller.rb

  def set_bid
    @bid = Bid.find(params[:id])
---
SELECT "bids".* FROM "bids" WHERE "bids"."id" = ? LIMIT 1  [["id", "10"]]

  def index
    @bids = Bid.all
---
SELECT "bids".* FROM "bids"

  def create
    @bid = Bid.new
    @bid.idea_id = params[:idea_id]
    @bid.artist_id = current_artist.id

    if @bid.save
---
INSERT INTO "bids" ("artist_id", "idea_id") VALUES (?, ?)  [["artist_id", 1], ["idea_id", 2]]

  def update
    @bid.idea_id = params[:idea_id]
    @bid.artist_id = current_artist.id

    if @bid.save
---
UPDATE "bids" SET "idea_id" = ? WHERE "bids"."id" = 10  [["idea_id", 2]]

  def destroy

    @bid.destroy
---
DELETE FROM "bids" WHERE "bids"."id" = ?  [["id", 7]]