app/controllers/buyers_controller.rb

  def set_buyer
    @buyer = Buyer.find(params[:id])
---
SELECT "buyers".* FROM "buyers" WHERE "buyers"."id" = 2 ORDER BY "buyers"."id" ASC LIMIT 1

  def index
    @buyers = Buyer.all
---
SELECT "buyers".* FROM "buyers"

  def update
    @buyer.first_name = params[:first_name]
    @buyer.last_name = params[:last_name]
    @buyer.email = current_buyer.email

    if @buyer.save
---
UPDATE "buyers" SET "first_name" = ?, "last_name" = ? WHERE "buyers"."id" = 1  [["first_name", "Ben"], ["last_name", "Morales"]]

  def destroy

    @buyer.destroy
---
DELETE FROM "buyers" WHERE "buyers"."id" = ?  [["id", 3]]