app/controllers/ideas_controller.rb

SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? ORDER BY "ideas"."id" ASC LIMIT 1  [["id", 6]]
---
  def set_idea
    @idea = Idea.find(params[:id])

SELECT "ideas".* FROM "ideas" WHERE "ideas"."artist_id" = ?  [["artist_id", 1]]
SELECT "ideas".* FROM "ideas" WHERE "ideas"."buyer_id" = ?  [["buyer_id", 1]]
---
  def index
    if buyer_signed_in?
      @ideas = current_buyer.ideas
    elsif artist_signed_in?
      open_projects = Idea.where(:artist_id => nil)
      @ideas = current_artist.ideas + open_projects

    else
      @ideas = Idea.all

INSERT INTO "ideas" ("buyer_id", "category", "description", "post_date", "price", "size", "title") VALUES (?, ?, ?, ?, ?, ?, ?)  [["buyer_id", 4], ["category", "Painting"], ["description", "Big pile of cats"], ["post_date", Fri, 12 Jul 2013], ["price", 400.0], ["size", "1x2"], ["title", "Cats"]]
---
  def create
    @idea = Idea.new
    @idea.post_date = params[:post_date]
    @idea.title = params[:title]
    @idea.description = params[:description]
    @idea.price = params[:price]
    @idea.category = params[:category]
    @idea.size = params[:size]
    @idea.status = params[:status]
    @idea.rating = params[:rating]
    @idea.buyer_id = current_buyer.id
    @idea.artist_id = params[:artist_id]

    if @idea.save

UPDATE "ideas" SET "status" = ?, "artist_id" = ? WHERE "ideas"."id" = 2  [["status", "Open"], ["artist_id", 1]]
---
  def update
    @idea.post_date = params[:post_date]
    @idea.title = params[:title]
    @idea.description = params[:description]
    @idea.price = params[:price]
    @idea.category = params[:category]
    @idea.size = params[:size]
    @idea.status = params[:status]
    @idea.rating = params[:rating]
    @idea.buyer_id = current_buyer.id
    @idea.artist_id = params[:artist_id]

    if @idea.save