app/controllers/idea_images_controller.rb

SELECT "idea_images".* FROM "idea_images"
---
  def index
    @idea_images = IdeaImage.all

SELECT "idea_images".* FROM "idea_images" WHERE "idea_images"."id" = 1 LIMIT 1
---
  def show
    @idea_image = IdeaImage.find_by(id: params[:id])

INSERT INTO "idea_images" ("idea_id", "image") VALUES (?, ?)  [["idea_id", 6], ["image", "prague-city-breaks-51.jpg"]]
---
  def create
    @idea_image = IdeaImage.new
    @idea_image.image = params[:image]
    @idea_image.idea_id = params[:idea_id]

    if @idea_image.save

SELECT "idea_images".* FROM "idea_images" WHERE "idea_images"."id" = 1 LIMIT 1
---
  def edit
    @idea_image = IdeaImage.find_by(id: params[:id])

SELECT "idea_images".* FROM "idea_images" WHERE "idea_images"."id" = 1 LIMIT 1
UPDATE "idea_images" SET "image" = ? WHERE "idea_images"."id" = 1  [["image", "Mona_Lisa_by_Leonardo_da_Vinci.jpg"]]
---
  def update
    @idea_image = IdeaImage.find_by(id: params[:id])
    @idea_image.image = params[:image]
    @idea_image.idea_id = params[:idea_id]

    if @idea_image.save

SELECT "idea_images".* FROM "idea_images" WHERE "idea_images"."id" = ? LIMIT 1  [["id", "6"]]
DELETE FROM "idea_images" WHERE "idea_images"."id" = ?  [["id", 5]]
---
  def destroy
    @idea_image = IdeaImage.find_by(id: params[:id])
    @idea_image.destroy