app/controllers/portfolio_images_controller.rb

  def set_portfolio_image
    @portfolio_image = PortfolioImage.find(params[:id])
---
SELECT "portfolio_images".* FROM "portfolio_images" WHERE "portfolio_images"."id" = ? LIMIT 1  [["id", "1"]]

  def index
    @portfolio_images = PortfolioImage.all
---
SELECT "portfolio_images".* FROM "portfolio_images"

  def create
    @portfolio_image = PortfolioImage.new
    @portfolio_image.image = params[:image]
    @portfolio_image.artist_id = current_artist.id

    if @portfolio_image.save
---
INSERT INTO "portfolio_images" ("artist_id", "image") VALUES (?, ?)  [["artist_id", 1], ["image", "Capture.PNG"]]